## Production: export 💾
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                     NAME                                                      |
|--------|---------------------------------------------------------------------------------------------------------------|
| add    | `module.platform_support_freshdesk_export.aws_cloudwatch_log_metric_filter.platform_support_freshdesk_export` |
|        | `module.platform_support_freshdesk_export.aws_cloudwatch_metric_alarm.platform_support_freshdesk_export`      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.platform_support_freshdesk_export.aws_cloudwatch_log_metric_filter.platform_support_freshdesk_export will be created
  + resource "aws_cloudwatch_log_metric_filter" "platform_support_freshdesk_export" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/platform-support-freshdesk-export"
      + name           = "platform-support-freshdesk-export-error"
      + pattern        = "ERROR"

      + metric_transformation {
          + default_value = "0"
          + name          = "platform-support-freshdesk-export-error"
          + namespace     = "data-lake"
          + unit          = "Count"
          + value         = "1"
        }
    }

  # module.platform_support_freshdesk_export.aws_cloudwatch_metric_alarm.platform_support_freshdesk_export will be created
  + resource "aws_cloudwatch_metric_alarm" "platform_support_freshdesk_export" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:123456789012:mock-alarm-topic",
        ]
      + alarm_description                     = "Errors logged over 1 minute by the Platform / Support / Freshdesk export."
      + alarm_name                            = "platform-support-freshdesk-export-error"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "platform-support-freshdesk-export-error"
      + namespace                             = "data-lake"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:123456789012:mock-ok-topic",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.platform_support_freshdesk_export.aws_cloudwatch_metric_alarm.platform_support_freshdesk_export"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_support_freshdesk_export.aws_ssm_parameter.freshdesk_api_key"]

21 tests, 19 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
